In [67]:
import pandas as pd

In [68]:
groceries = pd.Series(data = [30, 6,"Yes", "No"], index = ["eggs","apples","milk","bread"])
groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [69]:
groceries.shape

(4,)

In [70]:
groceries.ndim

1

In [71]:
groceries.size

4

In [72]:
groceries.index

Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

In [73]:
 groceries.values

array([30, 6, 'Yes', 'No'], dtype=object)

In [74]:
"banana" in groceries

False

In [75]:
 groceries['eggs']

30

In [76]:
groceries[['milk', 'bread']]

milk     Yes
bread     No
dtype: object

In [77]:
groceries[0]

30

In [78]:
groceries[-1]

'No'

In [79]:
groceries[[0,1]]

eggs      30
apples     6
dtype: object

In [80]:
groceries.loc[['eggs','apples']]

eggs      30
apples     6
dtype: object

In [81]:
groceries.iloc[[2,3]]

milk     Yes
bread     No
dtype: object

In [82]:
groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [83]:
groceries['eggs'] = 2

In [84]:
groceries

eggs        2
apples      6
milk      Yes
bread      No
dtype: object

In [85]:
groceries.drop('apples')

eggs       2
milk     Yes
bread     No
dtype: object

In [86]:
groceries

eggs        2
apples      6
milk      Yes
bread      No
dtype: object

In [87]:
groceries.drop('apples', inplace =True)

In [88]:
groceries

eggs       2
milk     Yes
bread     No
dtype: object

In [89]:
# arithmetic operaions on pandas series

In [90]:
import pandas as pd

In [91]:
fruits  = pd.Series([10,6,3], ['apples', 'oranges','bananas'])

In [92]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [93]:
 fruits +2

apples     12
oranges     8
bananas     5
dtype: int64

In [94]:
fruits -2

apples     8
oranges    4
bananas    1
dtype: int64

In [95]:
fruits * 2

apples     20
oranges    12
bananas     6
dtype: int64

In [96]:
fruits /2

apples     5.0
oranges    3.0
bananas    1.5
dtype: float64

In [97]:
import numpy as np
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [98]:
np.sqrt(fruits)

apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64

In [99]:
np.exp(fruits)

apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

In [100]:
np.power(fruits ,2)

apples     100
oranges     36
bananas      9
dtype: int64

In [101]:
  fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [102]:
fruits['bananas'] +2

5

In [103]:
fruits.iloc[0] -2

8

In [104]:
fruits[['apples', 'oranges']] * 2

apples     20
oranges    12
dtype: int64

In [105]:
fruits.loc[['apples', "oranges"]]/2

apples     5.0
oranges    3.0
dtype: float64

In [106]:
groceries * 2

eggs          4
milk     YesYes
bread      NoNo
dtype: object

In [107]:
# the arithmatic operation that we want to use should be defined for all data types

In [112]:
import pandas as pd 

items  = [{'bikes': 20, "pants":30, "watches":35,"shirts":8,"shoes":8, "suits":45},
         {'bikes': 15,"glasses":50, "pants":5, "watches":10,"shoes":2, "shirts":2, "suits":7},
         {'bikes': 20, "pants":30, "watches":35,"shoes":10, "glasses":4}]

In [113]:
store_items  = pd.DataFrame(items, index= ["store 1","store 2", "store 3"])
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35     8.0      8   45.0      NaN
store 2     15      5       10     2.0      2    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [115]:
x = store_items.isnull().sum().sum()
print(x)

3

In [117]:
x = store_items.isnull()
print(x)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1  False  False    False   False  False  False     True
store 2  False  False    False   False  False  False    False
store 3  False  False    False    True  False   True    False

In [118]:
store_items.count()

bikes      3
pants      3
watches    3
shirts     2
shoes      3
suits      2
glasses    2
dtype: int64

### we can remove NaN values by either removing rows or columns

In [121]:
 store_items.dropna(axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 2     15      5       10     2.0      2    7.0     50.0

In [122]:
 store_items.dropna(axis = 1)

         bikes  pants  watches  shoes
store 1     20     30       35      8
store 2     15      5       10      2
store 3     20     30       35     10

# filling NaN with zeros (0)

In [123]:
store_items.fillna(0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35     8.0      8   45.0      0.0
store 2     15      5       10     2.0      2    7.0     50.0
store 3     20     30       35     0.0     10    0.0      4.0

# forward filling

In [125]:
store_items.fillna(method = "ffill" , axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35     8.0      8   45.0      NaN
store 2     15      5       10     2.0      2    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

In [126]:
store_items.fillna(method = "ffill" , axis = 1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0     8.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    2.0    7.0     50.0
store 3   20.0   30.0     35.0    35.0   10.0   10.0      4.0

# backward filling

In [128]:
store_items.fillna(method = "backfill" , axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35     8.0      8   45.0     50.0
store 2     15      5       10     2.0      2    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [129]:
store_items.fillna(method = "backfill" , axis = 1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0     8.0    8.0   45.0      NaN
store 2   15.0    5.0     10.0     2.0    2.0    7.0     50.0
store 3   20.0   30.0     35.0    10.0   10.0    4.0      4.0

 # filling the NaN with interpolations

In [130]:
store_items.interpolate(method = "linear" , axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35     8.0      8   45.0      NaN
store 2     15      5       10     2.0      2    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

In [131]:
store_items.interpolate(method = "linear" , axis=1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0     8.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    2.0    7.0     50.0
store 3   20.0   30.0     35.0    22.5   10.0    7.0      4.0